wrk_rps_merged/470
Running 5m test @ http://10.102.254.78:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 117.927ms, rate sampling interval: 568ms
  Thread calibration: mean lat.: 111.094ms, rate sampling interval: 561ms
  Thread calibration: mean lat.: 117.721ms, rate sampling interval: 592ms
  Thread calibration: mean lat.: 117.080ms, rate sampling interval: 587ms
  Thread calibration: mean lat.: 119.452ms, rate sampling interval: 592ms
  Thread calibration: mean lat.: 119.547ms, rate sampling interval: 580ms
  Thread calibration: mean lat.: 129.604ms, rate sampling interval: 526ms
  Thread calibration: mean lat.: 129.498ms, rate sampling interval: 647ms
  Thread calibration: mean lat.: 137.486ms, rate sampling interval: 695ms
  Thread calibration: mean lat.: 134.377ms, rate sampling interval: 631ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   161.26ms  144.86ms   3.46s    83.98%
    Req/Sec     9.59      6.80    30.00     67.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  147.07ms
 75.000%  230.91ms
 90.000%  297.73ms
 99.000%  625.66ms
 99.900%    1.43s 
 99.990%    3.30s 
 99.999%    3.47s 
100.000%    3.47s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.555     0.000000            1         1.00
      24.847     0.100000         2901         1.11
      59.167     0.200000         5804         1.25
      74.239     0.300000         8703         1.43
     127.231     0.400000        11607         1.67
     147.071     0.500000        14517         2.00
     153.343     0.550000        15983         2.22
     160.383     0.600000        17430         2.50
     171.135     0.650000        18863         2.86
     217.983     0.700000        20310         3.33
     230.911     0.750000        21768         4.00
     236.799     0.775000        22488         4.44
     242.559     0.800000        23212         5.00
     248.831     0.825000        23935         5.71
     255.871     0.850000        24661         6.67
     266.495     0.875000        25388         8.00
     276.991     0.887500        25750         8.89
     297.727     0.900000        26109        10.00
     322.815     0.912500        26473        11.43
     332.799     0.925000        26839        13.33
     344.831     0.937500        27199        16.00
     351.743     0.943750        27381        17.78
     359.679     0.950000        27560        20.00
     368.895     0.956250        27742        22.86
     382.719     0.962500        27924        26.67
     435.455     0.968750        28104        32.00
     446.719     0.971875        28196        35.56
     457.727     0.975000        28285        40.00
     470.271     0.978125        28376        45.71
     525.823     0.981250        28471        53.33
     547.839     0.984375        28558        64.00
     557.055     0.985938        28605        71.11
     565.759     0.987500        28648        80.00
     581.119     0.989062        28694        91.43
     634.879     0.990625        28740       106.67
     654.335     0.992188        28785       128.00
     663.039     0.992969        28809       142.22
     668.671     0.993750        28832       160.00
     675.327     0.994531        28852       182.86
     684.031     0.995313        28875       213.33
     744.447     0.996094        28898       256.00
     751.103     0.996484        28910       284.44
     756.735     0.996875        28921       320.00
     760.319     0.997266        28931       365.71
     770.559     0.997656        28943       426.67
    1285.119     0.998047        28954       512.00
    1356.799     0.998242        28961       568.89
    1359.871     0.998437        28965       640.00
    1383.423     0.998633        28971       731.43
    1404.927     0.998828        28977       853.33
    1436.671     0.999023        28982      1024.00
    1454.079     0.999121        28985      1137.78
    1553.407     0.999219        28988      1280.00
    2209.791     0.999316        28991      1462.86
    2355.199     0.999414        28995      1706.67
    2357.247     0.999512        28996      2048.00
    2463.743     0.999561        28998      2275.56
    2486.271     0.999609        28999      2560.00
    3203.071     0.999658        29001      2925.71
    3258.367     0.999707        29002      3413.33
    3260.415     0.999756        29004      4096.00
    3260.415     0.999780        29004      4551.11
    3274.751     0.999805        29006      5120.00
    3274.751     0.999829        29006      5851.43
    3274.751     0.999854        29006      6826.67
    3295.231     0.999878        29007      8192.00
    3295.231     0.999890        29007      9102.22
    3358.719     0.999902        29008     10240.00
    3358.719     0.999915        29008     11702.86
    3358.719     0.999927        29008     13653.33
    3393.535     0.999939        29009     16384.00
    3393.535     0.999945        29009     18204.44
    3393.535     0.999951        29009     20480.00
    3393.535     0.999957        29009     23405.71
    3393.535     0.999963        29009     27306.67
    3465.215     0.999969        29010     32768.00
    3465.215     1.000000        29010          inf
#[Mean    =      161.263, StdDeviation   =      144.858]
#[Max     =     3463.168, Total count    =        29010]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30050 requests in 5.00m, 146.45MB read
  Non-2xx or 3xx responses: 150
Requests/sec:    100.16
Transfer/sec:    499.82KB