wrk_rps_merged/518
Running 5m test @ http://10.100.83.143:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 696.453ms, rate sampling interval: 2684ms
  Thread calibration: mean lat.: 673.380ms, rate sampling interval: 2527ms
  Thread calibration: mean lat.: 698.276ms, rate sampling interval: 2334ms
  Thread calibration: mean lat.: 717.615ms, rate sampling interval: 2693ms
  Thread calibration: mean lat.: 679.522ms, rate sampling interval: 2641ms
  Thread calibration: mean lat.: 675.396ms, rate sampling interval: 2150ms
  Thread calibration: mean lat.: 696.384ms, rate sampling interval: 2508ms
  Thread calibration: mean lat.: 654.565ms, rate sampling interval: 2295ms
  Thread calibration: mean lat.: 693.846ms, rate sampling interval: 2445ms
  Thread calibration: mean lat.: 664.881ms, rate sampling interval: 2516ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   729.80ms  399.41ms   3.46s    72.48%
    Req/Sec     9.50      1.74    14.00     91.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  719.36ms
 75.000%  924.16ms
 90.000%    1.26s 
 99.000%    1.86s 
 99.900%    2.72s 
 99.990%    3.22s 
 99.999%    3.47s 
100.000%    3.47s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.537     0.000000            1         1.00
     250.879     0.100000         2897         1.11
     424.447     0.200000         5798         1.25
     528.383     0.300000         8693         1.43
     625.663     0.400000        11592         1.67
     719.359     0.500000        14525         2.00
     745.471     0.550000        15944         2.22
     771.583     0.600000        17385         2.50
     836.095     0.650000        18836         2.86
     857.599     0.700000        20303         3.33
     924.159     0.750000        21728         4.00
     947.199     0.775000        22459         4.44
     960.511     0.800000        23186         5.00
    1022.463     0.825000        23903         5.71
    1065.983     0.850000        24631         6.67
    1162.239     0.875000        25356         8.00
    1226.751     0.887500        25719         8.89
    1256.447     0.900000        26078        10.00
    1319.935     0.912500        26442        11.43
    1352.703     0.925000        26812        13.33
    1420.287     0.937500        27160        16.00
    1442.815     0.943750        27353        17.78
    1455.103     0.950000        27521        20.00
    1516.543     0.956250        27713        22.86
    1538.047     0.962500        27886        26.67
    1558.527     0.968750        28069        32.00
    1615.871     0.971875        28159        35.56
    1634.303     0.975000        28248        40.00
    1655.807     0.978125        28338        45.71
    1718.271     0.981250        28434        53.33
    1750.015     0.984375        28518        64.00
    1764.351     0.985938        28564        71.11
    1820.671     0.987500        28607        80.00
    1846.271     0.989062        28653        91.43
    1915.903     0.990625        28698       106.67
    1952.767     0.992188        28743       128.00
    1967.103     0.992969        28766       142.22
    2043.903     0.993750        28788       160.00
    2138.111     0.994531        28811       182.86
    2226.175     0.995313        28834       213.33
    2316.287     0.996094        28856       256.00
    2336.767     0.996484        28869       284.44
    2353.151     0.996875        28879       320.00
    2377.727     0.997266        28890       365.71
    2443.263     0.997656        28902       426.67
    2519.039     0.998047        28913       512.00
    2547.711     0.998242        28919       568.89
    2564.095     0.998437        28924       640.00
    2646.015     0.998633        28930       731.43
    2662.399     0.998828        28936       853.33
    2719.743     0.999023        28941      1024.00
    2758.655     0.999121        28944      1137.78
    2768.895     0.999219        28947      1280.00
    2818.047     0.999316        28951      1462.86
    2836.479     0.999414        28953      1706.67
    2850.815     0.999512        28955      2048.00
    2926.591     0.999561        28958      2275.56
    2926.591     0.999609        28958      2560.00
    2953.215     0.999658        28960      2925.71
    2955.263     0.999707        28961      3413.33
    2957.311     0.999756        28962      4096.00
    3039.231     0.999780        28963      4551.11
    3043.327     0.999805        28964      5120.00
    3047.423     0.999829        28965      5851.43
    3047.423     0.999854        28965      6826.67
    3223.551     0.999878        28966      8192.00
    3223.551     0.999890        28966      9102.22
    3342.335     0.999902        28967     10240.00
    3342.335     0.999915        28967     11702.86
    3342.335     0.999927        28967     13653.33
    3350.527     0.999939        28968     16384.00
    3350.527     0.999945        28968     18204.44
    3350.527     0.999951        28968     20480.00
    3350.527     0.999957        28968     23405.71
    3350.527     0.999963        28968     27306.67
    3465.215     0.999969        28969     32768.00
    3465.215     1.000000        28969          inf
#[Mean    =      729.798, StdDeviation   =      399.408]
#[Max     =     3463.168, Total count    =        28969]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29980 requests in 5.00m, 157.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 25
Requests/sec:     99.91
Transfer/sec:    536.79KB